"[\n    {\n        \"question\": \"What does it mean when the yellow lights are flashing on a school bus?\",\n        \"options\": [\"You should speed up to pass the bus.\", \"Prepare to stop.\", \"The bus is about to move.\", \"There are no children near.\"],\n        \"correct_answer\": \"Prepare to stop.\",\n        \"explanation\": \"The flashing yellow lights indicate that the bus is preparing to pick up or drop off children, and you should slow down and get ready to stop.\"\n    },\n    {\n        \"question\": \"What should you do when the red lights are flashing on a school bus?\",\n        \"options\": [\"Continue driving at the same speed.\", \"Stop your vehicle.\", \"Turn around and avoid the bus.\", \"Honk your horn.\"],\n        \"correct_answer\": \"Stop your vehicle.\",\n        \"explanation\": \"When the red lights are flashing, it is a signal for all vehicles to stop, as children may be boarding or disembarking.\"\n    },\n    {\n        \"question\": \"How far must you stop from a school bus when the red lights are flashing?\",\n        \"options\": [\"5 feet\", \"10 feet\", \"20 feet\", \"50 feet\"],\n        \"correct_answer\": \"20 feet\",\n        \"explanation\": \"You must stop at least 20 feet away from a school bus that is displaying flashing red lights to ensure the safety of children.\"\n    },\n    {\n        \"question\": \"Can you pass a school bus with flashing red lights in the opposite direction if there is a physical barrier?\",\n        \"options\": [\"Yes, it is allowed.\", \"No, you must stop.\", \"Only if the barrier is high.\", \"Only during daytime.\"],\n        \"correct_answer\": \"Yes, it is allowed.\",\n        \"explanation\": \"In certain jurisdictions, if there is a physical barrier such as a median, vehicles traveling in the opposite direction may be allowed to pass the bus.\"\n    },\n    {\n        \"question\": \"What action is illegal while a school bus has its red lights flashing?\",\n        \"options\": [\"Tapping your brakes.\", \"Stopping your vehicle.\", \"Using your cell phone.\", \"Turning left.\"],\n        \"correct_answer\": \"Using your cell phone.\",\n        \"explanation\": \"Using your cell phone while driving is illegal and dangerous, especially when a school bus has its red lights flashing.\"\n    },\n    {\n        \"question\": \"At what time of day are school bus signals typically activated?\",\n        \"options\": [\"Only in the morning.\", \"During school hours.\", \"Only in the afternoon.\", \"All day.\"],\n        \"correct_answer\": \"During school hours.\",\n        \"explanation\": \"School bus signals are typically activated during school hours to ensure the safety of children as they get on and off the bus.\"\n    },\n    {\n        \"question\": \"What should you do if you are on a divided highway when a school bus has its red lights on?\",\n        \"options\": [\"Stop if you are in the same direction.\", \"Always speed up.\", \"Ignore the signals.\", \"Stop only if it is safe.\"],\n        \"correct_answer\": \"Stop if you are in the same direction.\",\n        \"explanation\": \"If you are on the same side of the divided highway as the bus, you must stop when the red lights are flashing, even if there is a physical divider.\"\n    },\n    {\n        \"question\": \"What is the penalty for illegally passing a stopped school bus?\",\n        \"options\": [\"A warning.\", \"A small fine.\", \"A large fine and points on your license.\", \"No penalty.\"],\n        \"correct_answer\": \"A large fine and points on your license.\",\n        \"explanation\": \"Illegally passing a stopped school bus can result in significant fines and points on your driving record to discourage dangerous behavior.\"\n    },\n    {\n        \"question\": \"When may you proceed after stopping for a school bus with flashing red lights?\",\n        \"options\": [\"When the lights turn off and the bus begins to move.\", \"After 2 minutes.\", \"When the bus driver waves you on.\", \"When you see no children.\"],\n        \"correct_answer\": \"When the lights turn off and the bus begins to move.\",\n        \"explanation\": \"You should only proceed once the flashing red lights turn off and the bus has started moving again, indicating it is safe to do so.\"\n    },\n    {\n        \"question\": \"What is the main purpose of the Stop for School Bus sign?\",\n        \"options\": [\"To show a school zone.\", \"To remind drivers to drive slowly.\", \"To protect children getting on and off the bus.\", \"To alert drivers of bus schedules.\"],\n        \"correct_answer\": \"To protect children getting on and off the bus.\",\n        \"explanation\": \"The primary purpose of the Stop for School Bus sign is to ensure the safety of children as they"